<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/07dac0d8-b621-4fcc-a0c4-72bf4657c979/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.analytics.aws_kms_alias.analytics_bucket will be destroyed
  # (because aws_kms_alias.analytics_bucket is not in configuration)
  - resource "aws_kms_alias" "analytics_bucket" {
      - arn            = "arn:aws:kms:eu-central-1:898587786287:alias/analytics/cast/staging" -> null
      - id             = "alias/analytics/cast/staging" -> null
      - name           = "alias/analytics/cast/staging" -> null
      - target_key_arn = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
      - target_key_id  = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
    }

  # module.analytics.aws_kms_key.analytics_bucket will be destroyed
  # (because aws_kms_key.analytics_bucket is not in configuration)
  - resource "aws_kms_key" "analytics_bucket" {
      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 10 -> null
      - description                        = "cast.staging - analytics bucket encryption" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
      - is_enabled                         = true -> null
      - key_id                             = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::898587786287:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Application" = "cast"
          - "Name"        = "walletconnect-staging-cast"
          - "Namespace"   = "walletconnect"
          - "Stage"       = "staging"
        } -> null
    }

  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be destroyed
  # (because aws_s3_bucket.analytics-data-lake_bucket is not in configuration)
  - resource "aws_s3_bucket" "analytics-data-lake_bucket" {
      - arn                         = "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake" -> null
      - bucket                      = "walletconnect.cast.staging.analytics.data-lake" -> null
      - bucket_domain_name          = "walletconnect.cast.staging.analytics.data-lake.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "walletconnect.cast.staging.analytics.data-lake.s3.eu-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z21DNDUVLTQW6Q" -> null
      - id                          = "walletconnect.cast.staging.analytics.data-lake" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {
          - "Application" = "cast"
          - "Name"        = "walletconnect-staging-cast"
          - "Namespace"   = "walletconnect"
          - "Stage"       = "staging"
        } -> null

      - grant {
          - id          = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be destroyed
  # (because aws_s3_bucket_acl.analytics-data-lake_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {
      - acl    = "private" -> null
      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null
      - id     = "walletconnect.cast.staging.analytics.data-lake,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null
            }
        }
    }

  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be destroyed
  # (because aws_s3_bucket_public_access_block.analytics-data-lake_bucket is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "walletconnect.cast.staging.analytics.data-lake" -> null
      - id                      = "walletconnect.cast.staging.analytics.data-lake" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {
      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null
      - id     = "walletconnect.cast.staging.analytics.data-lake" -> null

      - rule {
          - bucket_key_enabled = true -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
    }

  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be destroyed
  # (because aws_s3_bucket_versioning.analytics-data-lake_bucket is not in configuration)
  - resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {
      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null
      - id     = "walletconnect.cast.staging.analytics.data-lake" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 91 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access must be replaced
-/+ resource "aws_iam_policy" "analytics-data-lake_bucket_access" {
      ~ arn         = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)
      ~ description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake" -> "Allows staging-cast to read/write from walletconnect.data-lake.staging" # forces replacement
      ~ id          = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)
        name        = "staging-cast_analytics-data-lake_bucket_access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake",
                        ]
                      - Sid      = "ListObjectsInAnalyticsBucket"
                    },
                  - {
                      - Action   = [
                          - "s3:*Object",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake/*",
                        ]
                      - Sid      = "AllObjectActionsInAnalyticsBucket"
                    },
                  - {
                      - Action   = [
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742",
                        ]
                      - Sid      = "AllGenerateDataKeyForAnalyticsBucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id   = "ANPA5COABPQXSTCNXAT26" -> (known after apply)
      - tags        = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_policy.geoip_bucket_access will be updated in-place
  ~ resource "aws_iam_policy" "geoip_bucket_access" {
        id          = "arn:aws:iam::898587786287:policy/staging-cast_geoip_bucket_access"
        name        = "staging-cast_geoip_bucket_access"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",
                        ]
                      - Sid      = "ListObjectsInGeoipBucket"
                    },
                  - {
                      - Action   = [
                          - "s3:CopyObject",
                          - "s3:GetObject",
                          - "s3:HeadObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",
                        ]
                      - Sid      = "AllObjectActionsInGeoipBucket"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be destroyed
  # (because aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {
      - id         = "staging-cast-ecs-task-execution-role-20230403071327851400000002" -> null
      - policy_arn = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> null
      - role       = "staging-cast-ecs-task-execution-role" -> null
    }

  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake_policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "analytics-data-lake_policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-cast-ecs-task-execution-role"
    }

  # module.ecs.aws_s3_bucket.analytics_data_lake-bucket will be created
  + resource "aws_s3_bucket" "analytics_data_lake-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "walletconnect.data-lake.staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Application" = "cast"
          + "Name"        = "walletconnect-staging-cast"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 4 to add, 2 to change, 10 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.analytics.aws_kms_alias.analytics_bucket will be destroyed%0A  # (because aws_kms_alias.analytics_bucket is not in configuration)%0A  - resource "aws_kms_alias" "analytics_bucket" {%0A      - arn            = "arn:aws:kms:eu-central-1:898587786287:alias/analytics/cast/staging" -> null%0A      - id             = "alias/analytics/cast/staging" -> null%0A      - name           = "alias/analytics/cast/staging" -> null%0A      - target_key_arn = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A      - target_key_id  = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A    }%0A%0A  # module.analytics.aws_kms_key.analytics_bucket will be destroyed%0A  # (because aws_kms_key.analytics_bucket is not in configuration)%0A  - resource "aws_kms_key" "analytics_bucket" {%0A      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A      - bypass_policy_lockout_safety_check = false -> null%0A      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null%0A      - deletion_window_in_days            = 10 -> null%0A      - description                        = "cast.staging - analytics bucket encryption" -> null%0A      - enable_key_rotation                = true -> null%0A      - id                                 = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A      - is_enabled                         = true -> null%0A      - key_id                             = "bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A      - key_usage                          = "ENCRYPT_DECRYPT" -> null%0A      - multi_region                       = false -> null%0A      - policy                             = jsonencode(%0A            {%0A              - Id        = "key-default-1"%0A              - Statement = [%0A                  - {%0A                      - Action    = "kms:*"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::898587786287:root"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "Enable IAM User Permissions"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Application" = "cast"%0A          - "Name"        = "walletconnect-staging-cast"%0A          - "Namespace"   = "walletconnect"%0A          - "Stage"       = "staging"%0A        } -> null%0A    }%0A%0A  # module.analytics.aws_s3_bucket.analytics-data-lake_bucket will be destroyed%0A  # (because aws_s3_bucket.analytics-data-lake_bucket is not in configuration)%0A  - resource "aws_s3_bucket" "analytics-data-lake_bucket" {%0A      - arn                         = "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake" -> null%0A      - bucket                      = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - bucket_domain_name          = "walletconnect.cast.staging.analytics.data-lake.s3.amazonaws.com" -> null%0A      - bucket_regional_domain_name = "walletconnect.cast.staging.analytics.data-lake.s3.eu-central-1.amazonaws.com" -> null%0A      - force_destroy               = false -> null%0A      - hosted_zone_id              = "Z21DNDUVLTQW6Q" -> null%0A      - id                          = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - object_lock_enabled         = false -> null%0A      - region                      = "eu-central-1" -> null%0A      - request_payer               = "BucketOwner" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {%0A          - "Application" = "cast"%0A          - "Name"        = "walletconnect-staging-cast"%0A          - "Namespace"   = "walletconnect"%0A          - "Stage"       = "staging"%0A        } -> null%0A%0A      - grant {%0A          - id          = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = true -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A                  - sse_algorithm     = "aws:kms" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = true -> null%0A          - mfa_delete = false -> null%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_acl.analytics-data-lake_acl will be destroyed%0A  # (because aws_s3_bucket_acl.analytics-data-lake_acl is not in configuration)%0A  - resource "aws_s3_bucket_acl" "analytics-data-lake_acl" {%0A      - acl    = "private" -> null%0A      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - id     = "walletconnect.cast.staging.analytics.data-lake,private" -> null%0A%0A      - access_control_policy {%0A          - grant {%0A              - permission = "FULL_CONTROL" -> null%0A%0A              - grantee {%0A                  - id   = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A                  - type = "CanonicalUser" -> null%0A                }%0A            }%0A          - owner {%0A              - id = "2e899ba9939abd99d56104a1a450a63cdadde4979ab3a759e500f860d740ea1e" -> null%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_public_access_block.analytics-data-lake_bucket will be destroyed%0A  # (because aws_s3_bucket_public_access_block.analytics-data-lake_bucket is not in configuration)%0A  - resource "aws_s3_bucket_public_access_block" "analytics-data-lake_bucket" {%0A      - block_public_acls       = true -> null%0A      - block_public_policy     = true -> null%0A      - bucket                  = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - id                      = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - ignore_public_acls      = true -> null%0A      - restrict_public_buckets = true -> null%0A    }%0A%0A  # module.analytics.aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket will be destroyed%0A  # (because aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket is not in configuration)%0A  - resource "aws_s3_bucket_server_side_encryption_configuration" "analytics-data-lake_bucket" {%0A      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - id     = "walletconnect.cast.staging.analytics.data-lake" -> null%0A%0A      - rule {%0A          - bucket_key_enabled = true -> null%0A%0A          - apply_server_side_encryption_by_default {%0A              - kms_master_key_id = "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742" -> null%0A              - sse_algorithm     = "aws:kms" -> null%0A            }%0A        }%0A    }%0A%0A  # module.analytics.aws_s3_bucket_versioning.analytics-data-lake_bucket will be destroyed%0A  # (because aws_s3_bucket_versioning.analytics-data-lake_bucket is not in configuration)%0A  - resource "aws_s3_bucket_versioning" "analytics-data-lake_bucket" {%0A      - bucket = "walletconnect.cast.staging.analytics.data-lake" -> null%0A      - id     = "walletconnect.cast.staging.analytics.data-lake" -> null%0A%0A      - versioning_configuration {%0A          - status = "Enabled" -> null%0A        }%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:91" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 91 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.analytics-data-lake_bucket_access must be replaced%0A-/+ resource "aws_iam_policy" "analytics-data-lake_bucket_access" {%0A      ~ arn         = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)%0A      ~ description = "Allows staging-cast to read/write from walletconnect.cast.staging.analytics.data-lake" -> "Allows staging-cast to read/write from walletconnect.data-lake.staging" # forces replacement%0A      ~ id          = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> (known after apply)%0A        name        = "staging-cast_analytics-data-lake_bucket_access"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "s3:ListBucket",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake",%0A                        ]%0A                      - Sid      = "ListObjectsInAnalyticsBucket"%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:*Object",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::walletconnect.cast.staging.analytics.data-lake/*",%0A                        ]%0A                      - Sid      = "AllObjectActionsInAnalyticsBucket"%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "kms:GenerateDataKey",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:kms:eu-central-1:898587786287:key/bdaee66a-1400-45a1-b99d-caf4b1948742",%0A                        ]%0A                      - Sid      = "AllGenerateDataKeyForAnalyticsBucket"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A      ~ policy_id   = "ANPA5COABPQXSTCNXAT26" -> (known after apply)%0A      - tags        = {} -> null%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.geoip_bucket_access will be updated in-place%0A  ~ resource "aws_iam_policy" "geoip_bucket_access" {%0A        id          = "arn:aws:iam::898587786287:policy/staging-cast_geoip_bucket_access"%0A        name        = "staging-cast_geoip_bucket_access"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "s3:ListBucket",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect",%0A                        ]%0A                      - Sid      = "ListObjectsInGeoipBucket"%0A                    },%0A                  - {%0A                      - Action   = [%0A                          - "s3:CopyObject",%0A                          - "s3:GetObject",%0A                          - "s3:HeadObject",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = [%0A                          - "arn:aws:s3:::staging.relay.geo.ip.database.private.staging.walletconnect/*",%0A                        ]%0A                      - Sid      = "AllObjectActionsInGeoipBucket"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach will be destroyed%0A  # (because aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "analytics-data-lake-bucket-policy-attach" {%0A      - id         = "staging-cast-ecs-task-execution-role-20230403071327851400000002" -> null%0A      - policy_arn = "arn:aws:iam::898587786287:policy/staging-cast_analytics-data-lake_bucket_access" -> null%0A      - role       = "staging-cast-ecs-task-execution-role" -> null%0A    }%0A%0A  # module.ecs.aws_iam_role_policy_attachment.analytics-data-lake_policy-attach will be created%0A  + resource "aws_iam_role_policy_attachment" "analytics-data-lake_policy-attach" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "staging-cast-ecs-task-execution-role"%0A    }%0A%0A  # module.ecs.aws_s3_bucket.analytics_data_lake-bucket will be created%0A  + resource "aws_s3_bucket" "analytics_data_lake-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "walletconnect.data-lake.staging"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "Application" = "cast"%0A          + "Name"        = "walletconnect-staging-cast"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "staging"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0APlan: 4 to add, 2 to change, 10 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*